<a href="https://colab.research.google.com/github/SharonCamacho/Taller_MinTIC/blob/main/Taller_MinTIC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Taller Análisis de Datos con Python

# Cargue del archivo

Primero vamos a cargar el archivo con la ayuda de la librería de pandas

Importo la librería de pandas

In [ ]:
import pandas as pd

Leo el archivo

In [ ]:
data = pd.read_csv('DataSet.csv',sep=';')

# Análisis Exploratorio

Exploramos el dataset con estos métodos de la librería de pandas

* df.head()
* df.tail()
* df.info()
* df.shape
* df.columns
* df.describe()
* df.value_counts()
* df.unique()
* df.nunique()

In [ ]:
data.head()
#Exploramos las 5 primeras líneas de mis datos

                          Nombre  Edad       Tr@bajo  ...   V2016    V2017    V2018
0     ketty-elvira/niño-calderon    58    management  ...  22.483  490.004  669.895
1    yanira-pilar/garcia-barreto    44    technician  ...  52.225  361.837  245.154
2   milton-marina/hernandez-vega    33  entrepreneur  ...  90.924  903.292  166.285
3     rocio-constanza/mora-lopez    47   blue-collar  ...   2.681  823.176   13.273
4  yeimi-constanza/arenas-torres    33           NaN  ...  68.063  552.045  123.810

[5 rows x 18 columns]

In [ ]:
data.tail()
#Exploramos las 5 últimas líneas de mis datos

                                 Nombre  Edad  ...    V2017    V2018
12045     diana-helena/lozada-rodriguez    39  ...  162.553  618.894
12046     fermin-mercedes/bolivar-garay    53  ...  388.493  249.875
12047               gloria-/diaz-rincon    35  ...   97.243  503.251
12048             larisa-/acosta-torres    49  ...   98.325  425.908
12049  diana-patricia/cabrera-izquierdo    36  ...      NaN      NaN

[5 rows x 18 columns]

In [ ]:
data.info()
#Nos da información sobre un DataFrame, incluido el tamaño,  
#las columnas (nombre, tipo de dato y cantidad de registros no nulos) 
#resumen de tipos de datos por columna y el uso de memoria.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12093 entries, 0 to 12092
Data columns (total 18 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Nombre                        12093 non-null  object
 1   Edad                          12093 non-null  int64
 2   Tr@bajo                       11994 non-null  object
 3   Trabajo                       11994 non-null  object
 4   Estado_Civil                  12093 non-null  object
 5   Nivel_escolaridad             12093 non-null  object
 6   Nivel_escolaridad.1           12093 non-null  object
 7   Tiene_Credito?                12093 non-null  object
 8   Medio_de_Comunicación         12093 non-null  object
 9   Duracion_ultimo_contacto_seg  12093 non-null  int64
 10  Order_D4te                    12093 non-null  object
 11  envio23$%3                    12093 non-null  object
 12  Segment                       12093 non-null  object
 13  Categ                         12093 non-null  object
 14  SubCat                        12093 non-null  object
 15  V2016                         12093 non-null  float64
 16  V2017                         12093 non-null  float64
 17  V2018                         12093 non-null  float64
dtypes: float64(3), int64(2), object(13)
memory usage: 1.7+ MB

In [ ]:
data.isnull().any()
#Permite ver para cada columna del dataframe si existe algún valor nulo
#Mostrará falso si no hay ningún valor nulo
#Mostrará verdadero si existe al menos un registro nulo

Nombre                          False
Edad                            False
Tr@bajo                          True
Trabajo                          True
Estado_Civil                    False
Nivel_escolaridad               False
Nivel_escolaridad.1             False
Tiene_Credito?                  False
Medio_de_Comunicación           False
Duracion_ultimo_contacto_seg    False
Order_D4te                      False
envio23$%3                      False
Segment                         False
Categ                           False
SubCat                          False
V2016                           False
V2017                           False
V2018                           False
dtype: bool

In [ ]:
data.isna().sum()
#Muestra la cantidad de registros nulos de cada columna
#También funciona así:
#data.isnull().sum()

Nombre                           0
Edad                             0
Tr@bajo                         98
Trabajo                         98
Estado_Civil                     0
Nivel_escolaridad                0
Nivel_escolaridad.1              0
Tiene_Credito?                   0
Medio_de_Comunicación            0
Duracion_ultimo_contacto_seg     0
Order_D4te                       0
envio23$%3                       0
Segment                          1
Categ                            1
SubCat                           1
V2016                            1
V2017                            1
V2018                            1
dtype: int64

In [ ]:
data.shape
#Indica el tamaño del dataframe
#(filas,columnas)

(12093, 18)

In [ ]:
data.columns
#Muestra los nombres de las columnas del dataframe

Index(['Nombre', 'Edad', 'Tr@bajo', 'Trabajo', 'Estado_Civil',
       'Nivel_escolaridad', 'Nivel_escolaridad.1', 'Tiene_Credito?',
       'Medio_de_Comunicación', 'Duracion_ultimo_contacto_seg', 'Order_D4te',
       'envio23$%3', 'Segment', 'Categ', 'SubCat', 'V2016', 'V2017', 'V2018'],
      dtype='object')

In [ ]:
data.describe()

#Genera estadísticas descriptivas incluyendo aquellas que resumen 
# la tendencia central, la dispersión y la forma de la distribución de un 
#conjunto de datos, excluyendo los valores de NaN.

               Edad  Duracion_ultimo_contacto_seg  ...         V2017         V2018
count  12050.000000                  12050.000000  ...  12049.000000  12049.000000
mean      36.761577                    210.417178  ...    495.046362    503.220365
std       14.134405                    239.633278  ...    289.715941    289.976062
min        2.000000                      1.000000  ...      1.054000      1.091000
25%       31.000000                     57.000000  ...    243.769000    250.136000
50%       38.000000                    147.000000  ...    488.121000    504.674000
75%       46.000000                    268.000000  ...    749.219000    755.638000
max       61.000000                   3881.000000  ...    999.510000    999.576000

[8 rows x 5 columns]

Para seleccionar **una** columna del dataframe ponemos entre corchetes [ ] y comillas simples o dobles "" el nombre de la columna que queremos, así:
```
nombre_dataframe['Nombre_Columna']
```

In [ ]:
#Aquí seleccionaremos los primeros 5 resgistros de la columna trabajo
data['Trabajo'].head()

0      management
1      technician
2    entrepreneur
3     blue-collar
4             NaN
Name: Trabajo, dtype: object

Los siguientes análisis se aplicarán en la columna ***Trabajo*** del dataframe

In [ ]:
data['Trabajo'].value_counts(dropna=False)

#Muestra el recuento de valores únicos en orden descendente, de modo que 
#el primer elemento sea el que se presente con mayor frecuencia. 
#Excluye los valores NA por defecto, por lo que se incluye el argumento
# dropna = False para que muestre también la cantidad de valores nulos

blue-collar      3741
management       1813
technician       1737
admin.           1406
services         1321
retired           444
entrepreneur      421
self-employed     360
housemaid         316
unemployed        282
student           111
NaN                98
Name: Trabajo, dtype: int64

In [ ]:
data['Trabajo'].unique()

#Muestra los valores únicos de las columnas por orden de apareción
#Esto NO ordena.

array(['management', 'technician', 'entrepreneur', 'blue-collar', nan,
       'retired', 'admin.', 'services', 'self-employed', 'unemployed',
       'housemaid', 'student'], dtype=object)

In [ ]:
data['Trabajo'].nunique(dropna=False)

#Cuenta los valores únicos de las columnas, ignorando los valores nulos
# se incluye el argumento dropna = False
# para que considere también los valores nulos

12

# Limpieza (parte 1)

Ya que la cantidad de nulos es muy poca los eliminaremos del dataframe. 

Para hacerlo es necesario sobre escribir el dataframe actual

In [ ]:
data = data.dropna()

#Al escribir 'data =' estamos sobrescribiendo el dataframe

#dropna nos permite eliminar las filas del dataframe donde existen valores nulos

In [ ]:
data.shape
#Observamos que nuestro dataframe tiene menos filas respecto al incio del ejercicio

(11951, 18)

In [ ]:
data.isnull().any()
#Observamos también que ya todas las columnas están en 'Falso'
#lo que indica que ninguna tiene valores nulos

Nombre                          False
Edad                            False
Tr@bajo                         False
Trabajo                         False
Estado_Civil                    False
Nivel_escolaridad               False
Nivel_escolaridad.1             False
Tiene_Credito?                  False
Medio_de_Comunicación           False
Duracion_ultimo_contacto_seg    False
Order_D4te                      False
envio23$%3                      False
Segment                         False
Categ                           False
SubCat                          False
V2016                           False
V2017                           False
V2018                           False
dtype: bool

In [ ]:
data.isnull().sum()
#Aquí también vemos que ya no existen valores nulos

Nombre                          0
Edad                            0
Tr@bajo                         0
Trabajo                         0
Estado_Civil                    0
Nivel_escolaridad               0
Nivel_escolaridad.1             0
Tiene_Credito?                  0
Medio_de_Comunicación           0
Duracion_ultimo_contacto_seg    0
Order_D4te                      0
envio23$%3                      0
Segment                         0
Categ                           0
SubCat                          0
V2016                           0
V2017                           0
V2018                           0
dtype: int64

In [ ]:
data['Medio_de_Comunicación'].unique()
#Vemos los valores únicos de la columna 'medio de comunicación'

array(['unknown'], dtype=object)

### Como seleccionar una parte del dataframe

Ahora vamos a elimar las columnas que están duplicadas o que no aportan a nuestro análisis

Para hacerlo, primero debemos aprender a filtrar el data set.

El método ***.loc[ ]*** que se usa así:
```
nombre_dataframe.loc[ ]
```
nos ayuda a hacerlo. Dentro de los corchetes indicaremos la cantidad de filas y columnas que deseamos seleccionar.
```
nombre_dataframe.loc[filas, columnas]
```

**Ejemplos**

In [ ]:
#Para seleccionar todas las filas y todas las columnas usamos dos puntos:
data.loc[:,:]

                                Nombre  Edad  ...    V2017    V2018
0           ketty-elvira/niño-calderon    58  ...  490.004  669.895
1          yanira-pilar/garcia-barreto    44  ...  361.837  245.154
2         milton-marina/hernandez-vega    33  ...  903.292  166.285
3           rocio-constanza/mora-lopez    47  ...  823.176   13.273
5         claudia-stella/lopez-montoya    35  ...  263.574  183.894
...                                ...   ...  ...      ...      ...
12044  monica-patricia/trujillo-segura    32  ...  510.900  582.269
12045    diana-helena/lozada-rodriguez    39  ...  162.553  618.894
12046    fermin-mercedes/bolivar-garay    53  ...  388.493  249.875
12047              gloria-/diaz-rincon    35  ...   97.243  503.251
12048            larisa-/acosta-torres    49  ...   98.325  425.908

[11951 rows x 18 columns]

In [ ]:
#Para seleccionar la segunda fila (o sea la fila con índice 1) ponemos 1
# y para todas las columnas usamos dos puntos:
data.loc[1,:]

Nombre                          yanira-pilar/garcia-barreto
Edad                                                     44
Tr@bajo                                          technician
Trabajo                                          technician
Estado_Civil                                         single
Nivel_escolaridad                                 secondary
Nivel_escolaridad.1                               secondary
Tiene_Credito?                                           no
Medio_de_Comunicación                               unknown
Duracion_ultimo_contacto_seg                            151
Order_D4te                                         25/03/18
envio23$%3                                     Express_Aire
Segment                                         Corporativo
Categ                                               Muebles
SubCat                               Lapiceros_y_Marcadores
V2016                                                52.225
V2017                                               361.837
V2018                                               245.154
Name: 1, dtype: object

**Seleccionar un rango de filas:**

Si quiero seleccionar un rango de filas se realiza indicando los índices de los registros, es decir los números que aparecen en la primera columna del dataframe y cuya columna no tiene nombre. Para filtrar todas las columnas seguimos usando los dos puntos (:), así:
```
nombre_dataframe[índice_incio , índice_fin : ]
```
**Nota:**
Si quiero filtrar desde el inicio o hasta el final no es necesario indicar el índice.

Ejemplo:


*   Desde el índice 400 hasta el final
```
nombre_dataframe.loc[400:, :]
```
*   Desde el inico hasta el índice 30
```
nombre_dataframe.loc[:30, :]
```

In [ ]:
#Voy a filtrar los índices del 3 al 10 y todas las columnas

data.loc[3:10,:]

                          Nombre  Edad       Tr@bajo  ...    V2016    V2017    V2018
3     rocio-constanza/mora-lopez    47   blue-collar  ...    2.681  823.176   13.273
5   claudia-stella/lopez-montoya    35    management  ...   25.144  263.574  183.894
6                      #¿NOMBRE?    28    management  ...  685.000  869.217  230.038
7    ayda-patricia/forero-torres    42  entrepreneur  ...   91.288  490.689  242.102
8      sandra-ivan/bolivar-lemus    58       retired  ...   76.319  158.927  948.683
9         rosa-/bautista-laverde    43    technician  ...   35.677  204.282    9.592
10       elizabeth-/cera-mahecha    41        admin.  ...   85.080  441.630  536.436

[7 rows x 18 columns]

**Seleccionar más de una columna**

Para selecionar las columnas se hace con los nombres de las mismas entre corchetes [ ] y comillas simples ' ' o dobles " ". Para filtrar las filas se hace de la misma manera.


```
nombre_dataframe.loc[indice_inicio: indice fin,['nombre_col_1', 'nombre_col_2']]
```

In [ ]:
#Selecionar todas las filas y las columnas
#'Tr@bajo' y 'Medio_de_Comunicación'

data.loc[:,['Tr@bajo','Medio_de_Comunicación']]

            Tr@bajo Medio_de_Comunicación
0        management               unknown
1        technician               unknown
2      entrepreneur               unknown
3       blue-collar               unknown
5        management               unknown
...             ...                   ...
12044   blue-collar               unknown
12045   blue-collar               unknown
12046       retired               unknown
12047      services               unknown
12048    technician               unknown

[11951 rows x 2 columns]

In [ ]:
#Selecionar todas las filas con índice del 10 al 15 y las columnas
#'Tr@bajo' y 'Medio_de_Comunicación'

data.loc[10:15,['Tr@bajo','Medio_de_Comunicación']]

       Tr@bajo Medio_de_Comunicación
10      admin.               unknown
11      admin.               unknown
12  technician               unknown
13  technician               unknown
14    services               unknown
15     retired               unknown

### Continuación limpieza

Para borrar las columnas o filas que no quiero utilizar, debo filtrar el data por esas filas y/o columas y luego utilizar el método drop

In [ ]:
borrar = data.loc[:,['Tr@bajo','Medio_de_Comunicación','Nivel_escolaridad.1']]

#Creo un nuevo dataframe que contiene lo que quiero borrar
#En este caso las columnas Tr@bajo, Medio_de_Comunicación y Nivel_escolaridad.1

In [ ]:
data = data.drop(borrar,axis=1)

#Al escribir 'data =' estamos sobrescribiendo el dataframe

#drop nos permite eliminar la parte del dataframe que ya almacenamos en la 
#variable borrar. Ponemos axis=1 para que borre las columnas

In [ ]:
#También lo puedo hacer directamente sin crear otro objeto

#data = data.drop(data.loc[:,['Tr@bajo','Medio_de_Comunicación','Nivel_escolaridad.1']], axis=1)

#Sin embargo si ejecuto las dos instrucciones generaría un error porque en 
#la primera línea de código ya fueron eliminadas estas columnas
#por esto toda esta parte está comentada

In [ ]:
data.columns
#Aquí evidenciados que efectivamente borramos las columnas

Index(['Nombre', 'Edad', 'Trabajo', 'Estado_Civil', 'Nivel_escolaridad',
       'Tiene_Credito?', 'Duracion_ultimo_contacto_seg', 'Order_D4te',
       'envio23$%3', 'Segment', 'Categ', 'SubCat', 'V2016', 'V2017', 'V2018'],
      dtype='object')

In [ ]:
data.shape
#También vemos que disminuyó el número de columnas del dataframe

(11951, 15)

In [ ]:
operarios = data[data['Trabajo']=='blue-collar']

In [ ]:
operarios.shape

(3751, 15)

# Extraer una parte del dataframe:

También podemos filtrar del dataframe una parte de los datos que cumplan una determinada característica.

Por ejemplo, vamos a imaginar que soy el coordinador de la planta de producción y solo me interesan los datos de los operarios

Para filtrar el data set se utiliza el siguiente código:

In [ ]:
data[data['Trabajo']=='blue-collar']

                                Nombre  Edad  ...    V2017    V2018
3           rocio-constanza/mora-lopez    47  ...  823.176   13.273
17                 olga-/cabrera-gomez    57  ...  768.805   90.667
20                sandra-/gomez-ballen    28  ...  859.232  328.140
22         sandra-rosario/lopez-bernal    32  ...  279.766  183.387
33        ligia-gisela/murcia-mellizos    59  ...  551.683  762.588
...                                ...   ...  ...      ...      ...
12035      ketty-marina/lozano-arevalo    57  ...  688.124  944.846
12039    lilia-alejandro/morales-yepes    34  ...  630.356   25.157
12041       france-felipe/morales-peña    56  ...  405.114  135.197
12044  monica-patricia/trujillo-segura    32  ...  510.900  582.269
12045    diana-helena/lozada-rodriguez    39  ...  162.553  618.894

[3741 rows x 15 columns]

Lo que hace Python es crear una máscara que indica para cada índice si cumple o no la condición así:

In [ ]:
data['Trabajo']=='blue-collar'

0        False
1        False
2        False
3         True
5        False
         ...
12044     True
12045     True
12046    False
12047    False
12048    False
Name: Trabajo, Length: 11951, dtype: bool

Ahora vamos a crear una nueva variable llamada **Operarios** que va a contener el dataset filtrado por esta información

In [ ]:
operarios = data[data['Trabajo']=='blue-collar']

In [ ]:
operarios.head()

                          Nombre  Edad      Trabajo  ...   V2016    V2017    V2018
3     rocio-constanza/mora-lopez    47  blue-collar  ...   2.681  823.176   13.273
17           olga-/cabrera-gomez    57  blue-collar  ...  75.170  768.805   90.667
20          sandra-/gomez-ballen    28  blue-collar  ...  28.466  859.232  328.140
22   sandra-rosario/lopez-bernal    32  blue-collar  ...  68.778  279.766  183.387
33  ligia-gisela/murcia-mellizos    59  blue-collar  ...  49.201  551.683  762.588

[5 rows x 15 columns]

Observemos que los índices (los números de la izquierda) corresponde aún a los del dataframe anterior (el que contiene toda la información) y por esto salta del 3 al 17.

Para que los índices estén desde el 0 en adelante utilizamos el método ***.reset_index()***

In [ ]:
operarios = operarios.reset_index()

In [ ]:
operarios.head()
#Observa que ahora los índices inician desde el 0
#Se crea una nueva columna que se llama 'index'
#que guarda los indices del dataframe anterior

   index                        Nombre  Edad  ...   V2016    V2017    V2018
0      3    rocio-constanza/mora-lopez    47  ...   2.681  823.176   13.273
1     17           olga-/cabrera-gomez    57  ...  75.170  768.805   90.667
2     20          sandra-/gomez-ballen    28  ...  28.466  859.232  328.140
3     22   sandra-rosario/lopez-bernal    32  ...  68.778  279.766  183.387
4     33  ligia-gisela/murcia-mellizos    59  ...  49.201  551.683  762.588

[5 rows x 16 columns]